OpenROAD 9f7714859944860f802c7c961ba83ab4ae83849f 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /home/pvc/openroad/Digital-PLL/openroad/OpenROAD-flow-scripts/flow/platforms/gf180/lib/gf180mcu_fd_sc_mcu7t5v0__ff_n40C_3v60.lib.gz
read_liberty ./results/gf180/pll_digital_pll_controller/base/digital_pll_controller_typ.lib
read_liberty ./results/gf180/pll_ring_osc2x13/base/ring_osc2x13_typ.lib
read_db ./results/gf180/pll/base/3_1_place_gp_skip_io.odb
place_pins -hor_layers Metal3 -ver_layers Metal4
Found 2 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 444
[INFO PPL-0002] Number of I/O             37
[INFO PPL-0003] Number of I/O w/sink      37
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 5319.89 um.
Elapsed time: 0:00.60[h:]min:sec. CPU time: user 0.62 sys 0.04 (110%). Peak memory: 126436KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            123 f8d9f03193b8867e4e7c
