###############################################################################
# Created by write_sdc
###############################################################################
current_design digital_pll_controller
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name ring_clk -period 7.7480 [get_ports {clock}]
set_false_path\
    -from [get_ports {reset}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
