OpenROAD 9f7714859944860f802c7c961ba83ab4ae83849f 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
read_liberty /home/pvc/openroad/Digital-PLL/openroad/OpenROAD-flow-scripts/flow/platforms/gf180/lib/gf180mcu_fd_sc_mcu7t5v0__ff_n40C_3v60.lib.gz
read_db ./results/gf180/pll_digital_pll_controller/base/5_2_route.odb
filler_placement "gf180mcu_fd_sc_mcu7t5v0__fill_64 gf180mcu_fd_sc_mcu7t5v0__fill_32 gf180mcu_fd_sc_mcu7t5v0__fill_16 gf180mcu_fd_sc_mcu7t5v0__fill_8 gf180mcu_fd_sc_mcu7t5v0__fill_4 gf180mcu_fd_sc_mcu7t5v0__fill_2 gf180mcu_fd_sc_mcu7t5v0__fill_1"
[INFO DPL-0001] Placed 537 filler instances.
Elapsed time: 0:00.59[h:]min:sec. CPU time: user 0.58 sys 0.05 (107%). Peak memory: 127184KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            124 6662b873edbd900c5de0
