OpenROAD 9f7714859944860f802c7c961ba83ab4ae83849f 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 16 thread(s).
load_design 6_final.odb 6_final.sdc
read_liberty /home/pvc/openroad/Digital-PLL/openroad/OpenROAD-flow-scripts/flow/platforms/gf180/lib/gf180mcu_fd_sc_mcu7t5v0__ff_n40C_3v60.lib.gz
read_db ./results/gf180/pll_digital_pll_controller/base/6_final.odb
read_spef ./results/gf180/pll_digital_pll_controller/base/6_final.spef
Generating abstract views
write_timing_model ./results/gf180/pll_digital_pll_controller/base/digital_pll_controller_typ.lib
write_abstract_lef -bloat_occupied_layers ./results/gf180/pll_digital_pll_controller/base/digital_pll_controller.lef
Elapsed time: 0:00.84[h:]min:sec. CPU time: user 0.70 sys 0.29 (119%). Peak memory: 127608KB.
